/*Створіть додаток «Телефонна книга».Необхідно зберігати дані про абонента
(ПІБ, мобільний телефон(константа), дата народження(треба зробити класа Date без
default конструктора)) всередині відповідного класу.Треба зробити статичне поле 
для підрахунку кількості об'єктів класуНаповніть клас змінними - членами(полями), 
функціями - членами(методами),конструкторами, використовуйте ініціалізатор, реалізуйте 
деструктор.Обов’язково необхідно виділяти динамічно пам’ять під ПІБ.Надайте користувачеві 
можливість додавати нових абонентів, видаляти абонентів, шукати абонентів за ПІБ,показувати 
всіх абонентів.*/
#include<iostream>
#include "Abonent.h"

using namespace std;

int main()
{
	Abonent str;
	str.setSnp("Opoh Oleg Romanovich");
	str.getSnp();
	str.getNumber();
	str.input();
	str.output();
	return 0;
	system("pause");
}